app/controllers/locations_controller.rb

  def create
    @location = Location.new(location_params)

    respond_to do |format|
      if @location.save
---
INSERT INTO "locations" ("address", "description", "title", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["address", "new york usa"], ["description", "lorem"], ["title", "big apple"], ["created_at", 2016-11-02 19:13:04 UTC], ["updated_at", 2016-11-02 19:13:04 UTC]]

  def update
    respond_to do |format|
      if @location.update(location_params)
---
UPDATE "locations" SET "latitude" = ?, "longitude" = ?, "updated_at" = ? WHERE "locations"."id" = ?  [["latitude", 40.7127837], ["longitude", -74.0059413], ["updated_at", 2016-11-02 19:15:10 UTC], ["id", 1]]